## Exercises

In [1]:
library(tidyverse)
library(rvest)

── Attaching packages ─────────────────────────────────────── tidyverse 1.2.1 ──
✔ ggplot2 2.2.1     ✔ purrr   0.2.5
✔ tibble  1.4.2     ✔ dplyr   0.7.6
✔ tidyr   0.8.1     ✔ stringr 1.3.1
✔ readr   1.1.1     ✔ forcats 0.3.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
Loading required package: xml2

Attaching package: ‘rvest’

The following object is masked from ‘package:purrr’:

    pluck

The following object is masked from ‘package:readr’:

    guess_encoding

>1. Visit the following web page: [https://web.archive.org/web/20181024132313/http://www.stevetheump.com/Payrolls.htm](https://web.archive.org/web/20181024132313/http://www.stevetheump.com/Payrolls.htm)
>    Notice there are several tables. Say we are interested in comparing the payrolls of teams across the years. The next few exercises take us through the steps needed to do this.
>    Start by applying what you learned to read in the website into an object called `h`.

In [13]:
url <- "https://web.archive.org/web/20181024132313/http://www.stevetheump.com/Payrolls.htm"

In [14]:
h <- read_html(url)

>2. Note that, although not very useful, we can actually see the content of the page by typing: `html_text(h)`

>    The next step is to extract the tables. For this, we can use the `html_nodes` function. We learned that tables in html are associated with the `table` node.  Use the `html_nodes` function and the `table` node to extract the first table. Store it in an object `nodes`.

In [15]:
nodes <- html_nodes(h,'table')

>3. The `html_nodes` function returns a list of objects of class `xml_node`. We can see the content of each one using, for example, the `html_text` function. You can see the content for an arbitrarily picked component like this: `html_text(nodes[[8]])`

>    If the content of this object is an html table, we can use the `html_table` function to convert it to a data frame. Use the `html_table` function to convert the 8th entry of `nodes` into a table.

In [16]:
html_table(nodes[[8]]) %>% head(2)

  Team                  Payroll       Averge      Median
1 New York Yankees      $ 197,962,289 $ 6,186,321 $ 1,937,500
2 Philadelphia Phillies $ 174,538,938 $ 5,817,964 $ 1,875,000

>4. Repeat the above for the first 4 components of `nodes`. Which of the following are payroll tables:

>    A. All them.
    
>    B. 1
    
>    C. 2
    
>    __D__. 2-4

In [17]:
html_table(nodes[[1]]) %>% head(2)

  X1 X2
1 NA Salary Stats 1967-2019\nTop ML Player Salaries / Baseball's Luxury Tax

In [18]:
html_table(nodes[[2]]) %>% head(2)

  RANK TEAM                 Payroll
1 1    Boston Red Sox       $235.65M
2 2    San Francisco Giants $208.51M

In [19]:
html_table(nodes[[3]]) %>% head(2)

  X1   X2                  X3           X4            X5
1 Rank Team                25 Man       Disabled List Total Payroll
2 1    Los Angeles Dodgers $155,887,854 $37,354,166   $242,065,828

In [20]:
html_table(nodes[[4]]) %>% head(2)

  Rank Team    Opening Day   Avg Salary  Median
1 1    Dodgers $ 223,352,402 $ 7,445,080 $ 5,166,666
2 2    Yankees $ 213,472,857 $ 7,361,133 $ 3,300,000

>5. Repeat the above for the first __last__ 3 components of `nodes`. Which of the following is true:

>    __A__. The last entry in `nodes` shows the average across all teams through time, not payroll per team.

>    B. All three are payroll per team tables.

>    C. All three are like the first entry, not a payroll table.   

>    D. All of the above.

In [21]:
html_table(nodes[[length(nodes)]])  %>% head(2)

  X1   X2       X3      X4
1 Year Minimum  Average % Chg
2 2019 $555,000         -

In [22]:
html_table(nodes[[length(nodes)-1]]) %>% head(2)

  X1         X2          X3
1 Team       Payroll     Average
2 NY Yankees $92,538,260 $3,190,974

In [23]:
html_table(nodes[[length(nodes)-2]]) %>% head(2)

  X1         X2           X3
1 Team       Payroll      Average
2 NY Yankees $109,791,893 $3,541,674

>6. We have learned that the first and last entries of `nodes` are not payroll tables. Redefine `nodes` so that these two are removed.

In [24]:
del <- c(1,length(nodes))

In [25]:
nodes <- nodes[-del]

>7. We saw in the previous analysis that the first table node is not actually a table. This happens sometimes in html because tables are used to make text look a certain way, as opposed to storing numeric values. 

>    Remove the first component and then use `sapply` and `html_table` to covert each node in `nodes` into a table. Note that in this case, `sapply` will return a list of tables. You can also use `lapply` to assure that a list is applied.

In [26]:
nodes_tables <- nodes %>% lapply(html_table)

In [36]:
nodes_tables[14]

[[1]]
     X1                    X2           X3
1  Team               Payroll      Average
2    1.      New York Yankees $205,938,439
3    2.        Boston Red Sox $121,311,945
4    3.         New York Mets $104,770,139
5    4. Philadelphia Phillies  $95,337,908
6    5.    Los Angeles Angels  $95,017,822
7    6.   St. Louis Cardinals  $93,319,842
8    7.  San Francisco Giants  $89,487,842
9    8.          Chicago Cubs  $87,210,933
10   9.      Seattle Mariners  $85,883,333
11  10.        Atlanta Braves  $85,148,582
12  11.   Los Angeles Dodgers  $81,029,500
13  12.        Houston Astros  $76,779,022
14  13.     Chicago White Sox  $75,228,000
15  14.     Baltimore Orioles  $74,570,539
16  15.        Detroit Tigers  $68,998,183
17  16.  Arizona Diamondbacks  $63,015,834
18  17.      San Diego Padres  $62,888,192
19  18.       Florida Marlins  $60,375,961
20  19.       Cincinnati Reds  $59,658,275
21  20.       Minnesota Twins  $56,615,000
22  21.     Oakland Athletics  $55,869,262
23  22.         Texas Rangers  $55,307,258
24  23.  Washington Nationals  $48,581,500
25  24.      Colorado Rockies  $47,789,000
26  25.     Toronto Blue Jays  $45,336,500
27  26.     Cleveland Indians  $41,830,400
28  27.     Milwaukee Brewers  $40,234,833
29  28.    Pittsburgh Pirates  $38,138,000
30  29.    Kansas City Royals  $36,881,000
31  30.  Tampa Bay Devil Rays  $29,893,567

>8. Look through the resulting tables. Are they all the same? Could we just join them with `bind_rows`?

No, because table header names for the teams are different. The table headers for the tables 10-13 and 15-20 match and are called 'X1'.

In [42]:
bind_rows(nodes_tables[13:14]) %>% head
bind_rows(nodes_tables[13:14]) %>% tail

  X1                 X2            X3
1 Team               Payroll       NA
2 New York Yankees   $ 194,663,079 NA
3 Boston Red Sox     $ 120,099,824 NA
4 Los Angeles Angels $ 103,472,000 NA
5 Chicago White Sox  $ 102,750,667 NA
6 New York Mets      $ 101,084,963 NA

   X1  X2                   X3
57 25. Toronto Blue Jays    $45,336,500
58 26. Cleveland Indians    $41,830,400
59 27. Milwaukee Brewers    $40,234,833
60 28. Pittsburgh Pirates   $38,138,000
61 29. Kansas City Royals   $36,881,000
62 30. Tampa Bay Devil Rays $29,893,567

>9. Create two tables, call them `tab_1` and `tab_2` using entries 10 and 19.

In [81]:
tab_1 <- nodes_tables[[10]]; tab_1 %>% head
tab_2 <- nodes_tables[[19]]; tab_2 %>% head

  X1            X2           X3
1 Team          Payroll      Average
2 N.Y. Yankees  $201,449,289 $7,748,050
3 New York Mets 135,773,988  4,849,071
4 Chicago Cubs  135,050,000  5,402,000
5 Boston        122,696,000  4,089,867
6 Detroit       115,085,145  4,110,184

  X1          X2          X3
1 Team        Payroll     Average
2 NY Yankees  $92,538,260 $3,190,974
3 Los Angeles $88,124,286 $3,263,862
4 Atlanta     $84,537,836 $2,817,928
5 Baltimore   $81,447,435 $2,808,532
6 Arizona     $81,027,833 $2,893,851

>10. Use a `full_join` function to combine these two tables. Before you do this you will have to fix the missing header problem. You will also need to make the names match.

In [83]:
header_names <- tab_1 %>% filter(X1=="Team")

In [90]:
names(tab_1) <- header_names
names(tab_2) <- header_names

In [95]:
full_join(tab_1,tab_2,by = "Team") %>% arrange(Team)

   Team                Payroll.x    Average.x  Payroll.y   Average.y
1  Anaheim             NA           NA         $51,464,167 $1,715,472
2  Arizona             73,571,667   2,724,877  $81,027,833 $2,893,851
3  Atlanta             96,726,167   3,335,385  $84,537,836 $2,817,928
4  Baltimore           67,101,667   2,580,833  $81,447,435 $2,808,532
5  Boston              122,696,000  4,089,867  $77,940,333 $2,598,011
6  Chicago Cubs        135,050,000  5,402,000  $60,539,333 $2,017,978
7  Chicago White Sox   96,068,500   3,694,942  $31,133,500 $1,073,569
8  Cincinnati          70,968,500   2,957,021  $46,867,200 $1,735,822
9  Cleveland           81,625,567   3,023,169  $75,880,871 $2,918,495
10 Colorado            75,201,000   2,785,222  $61,111,190 $2,182,543
11 Detroit             115,085,145  4,110,184  $58,265,167 $2,157,969
12 Florida             36,814,000   1,314,786  $20,072,000 $692,138
13 Houston             102,996,415  3,814,682  $51,289,111 $1,899,597
14 Kansas City         70,908,333   2,727,244  $23,433,000 $836,893
15 Los Angeles         NA           NA         $88,124,286 $3,263,862
16 Los Angeles Angels  113,709,000  4,061,036  NA          NA
17 Los Angeles Dodgers 100,458,101  4,018,324  NA          NA
18 Milwaukee           80,257,502   3,086,827  $36,505,333 $1,140,792
19 Minnesota           65,299,267   2,251,699  $16,519,500 $635,365
20 Montreal            NA           NA         $34,807,833 $1,200,270
21 N.Y. Yankees        $201,449,289 $7,748,050 NA          NA
22 New York Mets       135,773,988  4,849,071  NA          NA
23 NY Mets             NA           NA         $79,509,776 $3,180,391
24 NY Yankees          NA           NA         $92,538,260 $3,190,974
25 Oakland             62,310,000   2,225,357  $31,971,333 $1,184,123
26 Philadelphia        113,004,048  4,185,335  $47,308,000 $1,631,310
27 Pittsburgh          48,743,000   1,874,731  $28,928,333 $1,112,628
28 San Diego           42,796,700   1,528,454  $54,821,000 $1,827,367
29 San Francisco       82,161,450   3,043,017  $53,737,826 $2,066,839
30 Seattle             98,904,167   3,532,292  $58,915,000 $2,265,962
31 St. Louis           88,528,411   3,278,830  $61,453,863 $2,276,069
32 Tampa Bay           63,313,035   2,183,208  $62,765,129 $2,024,682
33 Team                Payroll      Average    Payroll     Average
34 Texas               68,646,023   2,367,104  $70,795,921 $2,722,920
35 Toronto             80,993,657   2,892,631  $46,238,333 $1,778,397
36 Washington          59,328,000   2,045,793  NA          NA

>11. After joining the tables, you see several NAs. This is because some teams are in one table and not the other. Use the `anti_join` function to get a better idea of why this is happening.

In [96]:
tab_12 <- anti_join(tab_1,tab_2,by = "Team")
tab_21 <- anti_join(tab_2,tab_1,by = "Team")
bind_rows(tab_12,tab_21) %>% arrange(Team)

   Team                Payroll      Average
1  Anaheim             $51,464,167  $1,715,472
2  Los Angeles         $88,124,286  $3,263,862
3  Los Angeles Angels  113,709,000  4,061,036
4  Los Angeles Dodgers 100,458,101  4,018,324
5  Montreal            $34,807,833  $1,200,270
6  N.Y. Yankees        $201,449,289 $7,748,050
7  New York Mets       135,773,988  4,849,071
8  NY Mets             $79,509,776  $3,180,391
9  NY Yankees          $92,538,260  $3,190,974
10 Washington          59,328,000   2,045,793

>12. We see see that one of the problem is that Yankees are listed as both _N.Y. Yankees_ and _NY Yankees_. In the next section, we will learn efficient approaches to fixing problems like this. Here we can do it "by hand" as follows:

>    `tab_1 <- mutate(tab_1, Team = ifelse(Team == "N.Y. Yankees", "NY Yankees", Team))`

>    Now join the tables and show only Oakland and the Yankees and the payroll columns.

In [103]:
tab_1 <- mutate(tab_1, Team = ifelse(Team=="N.Y. Yankees", "NY Yankees", Team))

In [108]:
full_join(tab_1,tab_2,by = "Team") %>% filter(Team %in% c('Oakland','NY Yankees')) %>% select(Team,Payroll.x,Payroll.y)

  Team       Payroll.x    Payroll.y
1 NY Yankees $201,449,289 $92,538,260
2 Oakland    62,310,000   $31,971,333

>13. Advanced: extract the titles of the movies that won Best Picture from this website: [https://m.imdb.com/chart/bestpicture/](https://m.imdb.com/chart/bestpicture/)

In [3]:
url <- "https://m.imdb.com/chart/bestpicture/"

In [4]:
h <- read_html(url)

In [5]:
nodes <- html_nodes(h,'h4.best-picture-item-title')

In [39]:
html_text(nodes[[1]]) %>% str_split('\n') %>% .[[1]] %>% .[1]

[1] " The Shape of Water"

In [68]:
nodes %>% lapply(html_text) %>% str_replace('\n.*\n','')

 [1] " The Shape of Water"
 [2] " Moonlight"
 [3] " Spotlight"
 [4] " Birdman or (The Unexpected Virtue of Ignorance)"
 [5] " 12 Years a Slave"
 [6] " Argo"
 [7] " The Artist"
 [8] " The King's Speech"
 [9] " The Hurt Locker"
[10] " Slumdog Millionaire"
[11] " No Country for Old Men"
[12] " The Departed"
[13] " Crash"
[14] " Million Dollar Baby"
[15] " The Lord of the Rings: The Return of the King"
[16] " Chicago"
[17] " A Beautiful Mind"
[18] " Gladiator"
[19] " American Beauty"
[20] " Shakespeare in Love"
[21] " Titanic"
[22] " The English Patient"
[23] " Braveheart"
[24] " Forrest Gump"
[25] " Schindler's List"
[26] " Unforgiven"
[27] " The Silence of the Lambs"
[28] " Dances with Wolves"
[29] " Driving Miss Daisy"
[30] " Rain Man"
[31] " The Last Emperor"
[32] " Platoon"
[33] " Out of Africa"
[34] " Amadeus"
[35] " Terms of Endearment"
[36] " Gandhi"
[37] " Chariots of Fire"
[38] " Ordinary People"
[39] " Kramer vs. Kramer"
[40] " The Deer Hunter"
[41] " Annie Hall"
[42] " Rocky"
[43] " One Flew Over the Cuckoo's Nest"
[44] " The Godfather: Part II"
[45] " The Sting"
[46] " The Godfather"
[47] " The French Connection"
[48] " Patton"
[49] " Midnight Cowboy"
[50] " Oliver!"
[51] " In the Heat of the Night"
[52] " A Man for All Seasons"
[53] " The Sound of Music"
[54] " My Fair Lady"
[55] " Tom Jones"
[56] " Lawrence of Arabia"
[57] " West Side Story"
[58] " The Apartment"
[59] " Ben-Hur"
[60] " Gigi"
[61] " The Bridge on the River Kwai"
[62] " Around the World in 80 Days"
[63] " Marty"
[64] " On the Waterfront"
[65] " From Here to Eternity"
[66] " The Greatest Show on Earth"
[67] " An American in Paris"
[68] " All About Eve"
[69] " All the King's Men"
[70] " Hamlet"
[71] " Gentleman's Agreement"
[72] " The Best Years of Our Lives"
[73] " The Lost Weekend"
[74] " Going My Way"
[75] " Casablanca"
[76] " Mrs. Miniver"
[77] " How Green Was My Valley"
[78] " Rebecca"
[79] " Gone with the Wind"
[80] " You Can't Take It with You"
[81] " The Life of Emile Zola"
[82] " The Great Ziegfeld"
[83] " Mutiny on the Bounty"
[84] " It Happened One Night"
[85] " Cavalcade"
[86] " Grand Hotel"
[87] " Cimarron"
[88] " All Quiet on the Western Front"
[89] " The Broadway Melody"
[90] " Wings"
[91] " Sunrise: A Song of Two Humans"